{"text": "Making AI systems learn human-like representations of the world has\nmany known benefits, including improving generalization, robustness to domain\nshifts, and few-shot learning performance, among others.", "cats": {"causality": "0", "explainability": "0", "industry": "0"}}
{"text": "Experimental evaluation employing\nadapted versions of renowned models (e.g., BERT, RoBERTa) across established\nbenchmark English and multilingual datasets for text classification and\nsequence labeling shows that encrypted models achieve performance parity with\ntheir original counterparts.", "cats": {"explainability": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0", "causality": "0"}}
{"text": "In particular,\nHLA adopts a hierarchical framework and comprises three modules: a proficient\nLLM, referred to as Slow Mind, for intention reasoning and language\ninteraction, a lightweight LLM, referred to as Fast Mind, for generating macro\nactions, and a reactive policy, referred to as Executor, for transforming macro\nactions into atomic actions.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "Using real Automatic Identification System (AIS) data, we\nestimated the economic feasibility of the Shanghai-Busan high-traffic maritime\nroute and conducted a sensitivity analysis on factors affecting its economic\nviability.", "cats": {"industry": "1", "new-dataset": "1", "causality": "0"}}
{"text": "Unlike the existing VLN task that only pays attention to\nvision and instruction (language), the WebVLN agent further considers\nunderlying web-specific content like HTML, which could not be seen on the\nrendered web pages yet contains rich visual and textual information.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "The innovative approach of DIVSE lies in its adaptive\nlearning capability, which evolves over time to tailor voice outputs to\nspecific user traits.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "Incorporating deep\nreinforcement learning (DRL) with imitative learning methodologies, we bolster\nthe proficiency of our model.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0"}}
{"text": "To operationalise this metric, we engaged in a multi-step process\ninvolving collecting and annotating LLM responses, applying sophisticated\nNatural Language Processing (NLP) techniques for bias detection, and computing\nthe LLMBI score through a specially crafted mathematical formula.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "new-dataset": "0", "benchmark": "0", "ethical-ai": "0", "reproducibility": "0"}}
{"text": "If we focus only later in the pipeline -- making LLMs marginally\nmore fair as they facilitate use cases which intrinsically entrench power -- we\nwill miss an important opportunity to guide them to equitable impacts.", "cats": {"causality": "0", "industry": "0", "benchmark": "0"}}
{"text": "Deep neural networks (DNNs) have been demonstrated to be vulnerable to\nwell-crafted \\emph{adversarial examples}, which are generated through either\nwell-conceived $\\mathcal{L}_p$-norm restricted or unrestricted attacks.", "cats": {"new-dataset": "0", "causality": "0"}}
{"text": "For the scattering of a charged scalar field, both\nnear-extremal and extremal accelerating RN-AdS black holes cannot be\novercharged, thereby upholding the validity of the WCCC.", "cats": {"industry": "0", "ethical-ai": "0", "causality": "0"}}
{"text": "Identifying root causes of anomalies in causal processes is vital across\ndisciplines.", "cats": {"causality": "1", "ethical-ai": "0"}}
{"text": "Consequently, due to\nthe inability to reconstruct the original distribution and to discern the\nunderlying missingness mechanism, simply applying existing causal discovery\nmethods would lead to wrong conclusions.", "cats": {"causality": "1", "industry": "0", "reproducibility": "0"}}
{"text": "Using the results from the simulated data, we apply CD-NOTS to a broad range of\nindices and factors in order to identify causal connections among the entities,\nthereby showing how causal discovery can serve as a valuable tool for\nfactor-based investing, portfolio diversification, and comprehension of market\ndynamics.", "cats": {"causality": "1", "benchmark": "0", "reproducibility": "0"}}
{"text": "With the estimated (ratios\nof) causal coefficients, we propose a novel approach to identify the existence\nof a causal edge between two observed variables subject to latent variable\ninfluence.", "cats": {"causality": "1", "benchmark": "0", "industry": "0"}}
{"text": "In this work, we formulate this problem from a causal\nperspective.", "cats": {"causality": "1", "explainability": "0", "industry": "0"}}
{"text": "On the other hand, causality can exhibit\nemergence, meaning that new causal laws may arise as we increase the level of\nabstraction.", "cats": {"causality": "1", "new-dataset": "0", "benchmark": "0"}}
{"text": "Further, we prove that the IMA\nprinciple is approximately satisfied with high probability (increasing with the\nnumber of observed mixtures) when the directions along which the latent\ncomponents influence the observations are chosen independently at random.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "First, we categorize the biases into confounding bias and\nselection bias based on the causal structure they imply.", "cats": {"causality": "1", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0"}}
{"text": "Our approach aims to\ndetect inter-agent causal influences in specific situations based on the\ncriterion using causal intervention and conditional mutual information.", "cats": {"causality": "1", "explainability": "0", "reproducibility": "0", "benchmark": "0"}}
{"text": "We provide\nempirical evidence that uniform and active sampling techniques are able to\nconsistently reduce causal confusion as training progresses and that active\nsampling is able to do so significantly more efficiently than uniform sampling.", "cats": {"causality": "1", "industry": "0", "ethical-ai": "0", "new-dataset": "0"}}
{"text": "Systematic benchmarking and\nevaluation of these causal learning systems remains a critical challenge, due\nto the lack of suitable datasets and simulation environments.", "cats": {"causality": "1", "ethical-ai": "0"}}
{"text": "These properties are obstructed if higher orders of the deficit angle are taken\ninto account.", "cats": {"causality": "0"}}
{"text": "The inclusion\nof gravity introduces a logarithmic term into the time delay that interferes\nwith the straightforward bounds derivable in pure field theory, a fact\nconsistent with CEMZ and with recent results from dispersion relations.", "cats": {"causality": "0"}}
{"text": "Rev.", "cats": {"causality": "0"}}
{"text": "Through simulation and real data analysis, we demonstrate that our approach\nprovides a robust alternative to the existing MR methods.", "cats": {"causality": "0"}}
{"text": "Moreover, we introduce a taxonomy of Causality-Inspired GNNs\n(CIGNNs) based on the type of causal learning capability they are equipped\nwith, i.e., causal reasoning and causal representation learning.", "cats": {"causality": "1"}}
{"text": "Through joint optimization of\nsegmentation on mask tokens and concept prediction on semantic tokens, our\nmodel exhibits strong regional recognition and localization capabilities.", "cats": {"causality": "0"}}
{"text": "We explore two potential\nsolutions.", "cats": {"causality": "0"}}
{"text": "It is based on ideas of Kunzinger-S\\\"amann, but\ndoes not require Lipschitz continuity of causal curves.", "cats": {"causality": "0"}}
{"text": "Unlike real experiments where researchers assign pre-existing units across\nconditions, LLMs simulate units based on the entire prompt, which includes the\ndescription of the treatment.", "cats": {"causality": "0", "explainability": "0", "industry": "0"}}
{"text": "A number of ways\nto construct these many-body solitons (explicitly in the case where the local\nHilbert space dimension $d=2$) are then demonstrated: firstly, via a simple\nconstruction involving products of smaller, constituent solitons; and secondly,\nvia a construction which cannot be understood as simply in terms of products of\nsmaller solitons, but which does have a neat interpretation in terms of\nproducts of fermions under a Jordan-Wigner transformation.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0", "benchmark": "0"}}
{"text": "This framework employs an information-theoretic measure rooted in\na generalized version of Granger-causality, which is applicable to both linear\nand nonlinear dynamics.", "cats": {"causality": "1"}}
{"text": "This motivates us to extend our approach to extrapolating causal graphs through\niterated pairwise queries.", "cats": {"causality": "1", "explainability": "0", "industry": "0"}}
{"text": "We\nalso show that, under certain graphical conditions, RLCD correctly identifies\nthe Markov Equivalence Class of the whole latent causal graph asymptotically.", "cats": {"causality": "1", "benchmark": "0"}}
{"text": "Using a revised\nNavascu\\'es-Pironio-Ac\\'in method and Bayesian optimization, we find a proposal\nwith optimal coefficients of the correlation function which could give a larger\ndiscrimination between the real and quantum theories comparing with the\nexisting proposals.", "cats": {"causality": "0", "explainability": "0"}}
{"text": "Capturing the underlying structural causal relations represented by Directed\nAcyclic Graphs (DAGs) has been a fundamental task in various AI disciplines.", "cats": {"causality": "1"}}
{"text": "As a fundamental assumption to ensure\nspacetime causality, we investigated the weak cosmic censorship conjecture\n(WCCC) in the accelerating Reissner-Nordstr\\\"{o}m-Anti-de Sitter (RN-AdS)\nspacetime through the scattering of a charged field and the absorption of a\ncharged particle.", "cats": {"causality": "0"}}
{"text": "We also revisit the case of two gapless detectors and show that the detectors\ncan become entangled if there is two-way signalling between their interaction\nregions, providing closed-form expressions for the detectors' final state.", "cats": {"causality": "0"}}
{"text": "This paper provides a\ncomprehensive review of recent advancements in quantitative theories and\napplications of causal emergence.", "cats": {"causality": "1", "explainability": "0"}}
{"text": "We introduce a noisy functional causal model to account for this\npurpose.", "cats": {"causality": "1"}}
{"text": "Meanwhile,\nwe propose a data generation process for more controllable GPT prompting and\npresent two instruction-tuning datasets: (1) Causal-Retrieval-Bench for causal\nproblem identification and input parameter extraction for causal function\ncalling and (2) Causal-Interpret-Bench for in-context causal interpretation.", "cats": {"causality": "1"}}
