{"text": "Multiple\npricing policies were implemented within the simulator and analyzed for impact\non revenue, category penetration, and customer retention.", "cats": {"industry": "1"}}
{"text": "Making AI systems learn human-like representations of the world has\nmany known benefits, including improving generalization, robustness to domain\nshifts, and few-shot learning performance, among others.", "cats": {"causality": "0", "explainability": "0", "industry": "0"}}
{"text": "This platform will facilitate researchers in leveraging remote\nsensing data for large-scale applied research in areas such as resources,\nenvironment, ecology, and climate.", "cats": {"new-dataset": "1", "industry": "1"}}
{"text": "The paper contributes experimental insights to\ndiscussions on the economical, ethical, and legal considerations of AI\ntechnologies.", "cats": {"ethical-ai": "1", "reproducibility": "0", "industry": "1"}}
{"text": "In particular,\nHLA adopts a hierarchical framework and comprises three modules: a proficient\nLLM, referred to as Slow Mind, for intention reasoning and language\ninteraction, a lightweight LLM, referred to as Fast Mind, for generating macro\nactions, and a reactive policy, referred to as Executor, for transforming macro\nactions into atomic actions.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "Using real Automatic Identification System (AIS) data, we\nestimated the economic feasibility of the Shanghai-Busan high-traffic maritime\nroute and conducted a sensitivity analysis on factors affecting its economic\nviability.", "cats": {"industry": "1", "new-dataset": "1", "causality": "0"}}
{"text": "However, with\nthe limited amount of existing known forgeries, augmentation methods for\nforgery detection are highly desirable.", "cats": {"industry": "1"}}
{"text": "Unlike the existing VLN task that only pays attention to\nvision and instruction (language), the WebVLN agent further considers\nunderlying web-specific content like HTML, which could not be seen on the\nrendered web pages yet contains rich visual and textual information.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "We first\ncreated the README dataset, an extensive collection of over 20,000 unique\nmedical terms and 300,000 mentions, each offering context-aware lay definitions\nmanually annotated by domain experts.", "cats": {"new-dataset": "1", "benchmark": "0", "industry": "1", "explainability": "0"}}
{"text": "The innovative approach of DIVSE lies in its adaptive\nlearning capability, which evolves over time to tailor voice outputs to\nspecific user traits.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "Incorporating deep\nreinforcement learning (DRL) with imitative learning methodologies, we bolster\nthe proficiency of our model.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0"}}
{"text": "To operationalise this metric, we engaged in a multi-step process\ninvolving collecting and annotating LLM responses, applying sophisticated\nNatural Language Processing (NLP) techniques for bias detection, and computing\nthe LLMBI score through a specially crafted mathematical formula.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "new-dataset": "0", "benchmark": "0", "ethical-ai": "0", "reproducibility": "0"}}
{"text": "If we focus only later in the pipeline -- making LLMs marginally\nmore fair as they facilitate use cases which intrinsically entrench power -- we\nwill miss an important opportunity to guide them to equitable impacts.", "cats": {"causality": "0", "industry": "0", "benchmark": "0"}}
{"text": "How can we build AI systems that are aligned with human values and objectives\nin order to avoid causing harm or violating societal standards for acceptable\nbehavior?", "cats": {"ethical-ai": "1", "reproducibility": "0", "industry": "0"}}
{"text": "For the scattering of a charged scalar field, both\nnear-extremal and extremal accelerating RN-AdS black holes cannot be\novercharged, thereby upholding the validity of the WCCC.", "cats": {"industry": "0", "ethical-ai": "0", "causality": "0"}}
{"text": "Consumer credit services offered by e-commerce platforms provide customers\nwith convenient loan access during shopping and have the potential to stimulate\nsales.", "cats": {"industry": "1", "explainability": "0"}}
{"text": "Consequently, due to\nthe inability to reconstruct the original distribution and to discern the\nunderlying missingness mechanism, simply applying existing causal discovery\nmethods would lead to wrong conclusions.", "cats": {"causality": "1", "industry": "0", "reproducibility": "0"}}
{"text": "With the estimated (ratios\nof) causal coefficients, we propose a novel approach to identify the existence\nof a causal edge between two observed variables subject to latent variable\ninfluence.", "cats": {"causality": "1", "benchmark": "0", "industry": "0"}}
{"text": "In this work, we formulate this problem from a causal\nperspective.", "cats": {"causality": "1", "explainability": "0", "industry": "0"}}
{"text": "Further, we prove that the IMA\nprinciple is approximately satisfied with high probability (increasing with the\nnumber of observed mixtures) when the directions along which the latent\ncomponents influence the observations are chosen independently at random.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0", "benchmark": "0", "new-dataset": "0"}}
{"text": "First, we categorize the biases into confounding bias and\nselection bias based on the causal structure they imply.", "cats": {"causality": "1", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0"}}
{"text": "We provide\nempirical evidence that uniform and active sampling techniques are able to\nconsistently reduce causal confusion as training progresses and that active\nsampling is able to do so significantly more efficiently than uniform sampling.", "cats": {"causality": "1", "industry": "0", "ethical-ai": "0", "new-dataset": "0"}}
{"text": "Unlike real experiments where researchers assign pre-existing units across\nconditions, LLMs simulate units based on the entire prompt, which includes the\ndescription of the treatment.", "cats": {"causality": "0", "explainability": "0", "industry": "0"}}
{"text": "A number of ways\nto construct these many-body solitons (explicitly in the case where the local\nHilbert space dimension $d=2$) are then demonstrated: firstly, via a simple\nconstruction involving products of smaller, constituent solitons; and secondly,\nvia a construction which cannot be understood as simply in terms of products of\nsmaller solitons, but which does have a neat interpretation in terms of\nproducts of fermions under a Jordan-Wigner transformation.", "cats": {"causality": "0", "explainability": "0", "industry": "0", "reproducibility": "0", "ethical-ai": "0", "benchmark": "0"}}
{"text": "This motivates us to extend our approach to extrapolating causal graphs through\niterated pairwise queries.", "cats": {"causality": "1", "explainability": "0", "industry": "0"}}
