{"created":"2024-06-11 15:16:05","title":"Erasing Radio Frequency Fingerprints via Active Adversarial Perturbation","abstract":"Radio Frequency (RF) fingerprinting is to identify a wireless device from its uniqueness of the analog circuitry or hardware imperfections. However, unlike the MAC address which can be modified, such hardware feature is inevitable for the signal emitted to air, which can possibly reveal device whereabouts, e.g., a sniffer can use a pre-trained model to identify a nearby device when receiving its signal. Such fingerprint may expose critical private information, e.g., the associated upper-layer applications or the end-user. In this paper, we propose to erase such RF feature for wireless devices, which can prevent fingerprinting by actively perturbation from the signal perspective. Specifically, we consider a common RF fingerprinting scenario, where machine learning models are trained from pilot signal data for identification. A novel adversarial attack solution is designed to generate proper perturbations, whereby the perturbed pilot signal can hide the hardware feature and misclassify the model. We theoretically show that the perturbation would not affect the communication function within a tolerable perturbation threshold. We also implement the pilot signal fingerprinting and the proposed perturbation process in a practical LTE system. Extensive experiment results demonstrate that the RF fingerprints can be effectively erased to protect the user privacy.","sentences":["Radio Frequency (RF) fingerprinting is to identify a wireless device from its uniqueness of the analog circuitry or hardware imperfections.","However, unlike the MAC address which can be modified, such hardware feature is inevitable for the signal emitted to air, which can possibly reveal device whereabouts, e.g., a sniffer can use a pre-trained model to identify a nearby device when receiving its signal.","Such fingerprint may expose critical private information, e.g., the associated upper-layer applications or the end-user.","In this paper, we propose to erase such RF feature for wireless devices, which can prevent fingerprinting by actively perturbation from the signal perspective.","Specifically, we consider a common RF fingerprinting scenario, where machine learning models are trained from pilot signal data for identification.","A novel adversarial attack solution is designed to generate proper perturbations, whereby the perturbed pilot signal can hide the hardware feature and misclassify the model.","We theoretically show that the perturbation would not affect the communication function within a tolerable perturbation threshold.","We also implement the pilot signal fingerprinting and the proposed perturbation process in a practical LTE system.","Extensive experiment results demonstrate that the RF fingerprints can be effectively erased to protect the user privacy."],"url":"http://arxiv.org/abs/2406.07349v2"}
