{"created":"2024-04-17 17:55:27","title":"Private federated discovery of out-of-vocabulary words for Gboard","abstract":"The vocabulary of language models in Gboard, Google's keyboard application, plays a crucial role for improving user experience. One way to improve the vocabulary is to discover frequently typed out-of-vocabulary (OOV) words on user devices. This task requires strong privacy protection due to the sensitive nature of user input data. In this report, we present a private OOV discovery algorithm for Gboard, which builds on recent advances in private federated analytics. The system offers local differential privacy (LDP) guarantees for user contributed words. With anonymous aggregation, the final released result would satisfy central differential privacy guarantees with $\\varepsilon = 0.315, \\delta = 10^{-10}$ for OOV discovery in en-US (English in United States).","sentences":["The vocabulary of language models in Gboard, Google's keyboard application, plays a crucial role for improving user experience.","One way to improve the vocabulary is to discover frequently typed out-of-vocabulary (OOV) words on user devices.","This task requires strong privacy protection due to the sensitive nature of user input data.","In this report, we present a private OOV discovery algorithm for Gboard, which builds on recent advances in private federated analytics.","The system offers local differential privacy (LDP) guarantees for user contributed words.","With anonymous aggregation, the final released result would satisfy central differential privacy guarantees with $\\varepsilon = 0.315, \\delta = 10^{-10}$ for OOV discovery in en-US (English in United States)."],"url":"http://arxiv.org/abs/2404.11607v2"}
{"created":"2024-04-17 17:55:17","title":"Learning to Solve the Constrained Most Probable Explanation Task in Probabilistic Graphical Models","abstract":"We propose a self-supervised learning approach for solving the following constrained optimization task in log-linear models or Markov networks. Let $f$ and $g$ be two log-linear models defined over the sets $\\mathbf{X}$ and $\\mathbf{Y}$ of random variables respectively. Given an assignment $\\mathbf{x}$ to all variables in $\\mathbf{X}$ (evidence) and a real number $q$, the constrained most-probable explanation (CMPE) task seeks to find an assignment $\\mathbf{y}$ to all variables in $\\mathbf{Y}$ such that $f(\\mathbf{x}, \\mathbf{y})$ is maximized and $g(\\mathbf{x}, \\mathbf{y})\\leq q$. In our proposed self-supervised approach, given assignments $\\mathbf{x}$ to $\\mathbf{X}$ (data), we train a deep neural network that learns to output near-optimal solutions to the CMPE problem without requiring access to any pre-computed solutions. The key idea in our approach is to use first principles and approximate inference methods for CMPE to derive novel loss functions that seek to push infeasible solutions towards feasible ones and feasible solutions towards optimal ones. We analyze the properties of our proposed method and experimentally demonstrate its efficacy on several benchmark problems.","sentences":["We propose a self-supervised learning approach for solving the following constrained optimization task in log-linear models or Markov networks.","Let $f$ and $g$ be two log-linear models defined over the sets $\\mathbf{X}$ and $\\mathbf{Y}$ of random variables respectively.","Given an assignment $\\mathbf{x}$ to all variables in $\\mathbf{X}$ (evidence) and a real number $q$, the constrained most-probable explanation (CMPE) task seeks to find an assignment $\\mathbf{y}$ to all variables in $\\mathbf{Y}$ such that $f(\\mathbf{x}, \\mathbf{y})$ is maximized and $g(\\mathbf{x}, \\mathbf{y})\\leq q$. In our proposed self-supervised approach, given assignments $\\mathbf{x}$ to $\\mathbf{X}$ (data), we train a deep neural network that learns to output near-optimal solutions to the CMPE problem without requiring access to any pre-computed solutions.","The key idea in our approach is to use first principles and approximate inference methods for CMPE to derive novel loss functions that seek to push infeasible solutions towards feasible ones and feasible solutions towards optimal ones.","We analyze the properties of our proposed method and experimentally demonstrate its efficacy on several benchmark problems."],"url":"http://arxiv.org/abs/2404.11606v1"}
{"created":"2024-04-17 17:51:15","title":"Interaction Techniques for Exploratory Data Visualization on Mobile Devices","abstract":"The ubiquity and on-the-go availability of mobile devices makes them central to many tasks such as interpersonal communication and media consumption. However, despite the potential of mobile devices for on-demand exploratory data visualization, existing mobile interactions are difficult, often using highly custom interactions, complex gestures, or multi-modal input. We synthesize limitations from the literature and outline four motivating principles for improved mobile interaction: leverage ubiquitous modalities, prioritize discoverability, enable rapid in-context data exploration, and promote graceful recovery. We then contribute thirteen interaction candidates and conduct a formative study with twelve participants who experienced our interactions in a testbed prototype. Based on these interviews, we discuss design considerations and tradeoffs from four main themes: precise and rapid inspection, focused navigation, single-touch and fixed orientation interaction, and judicious use of motion.","sentences":["The ubiquity and on-the-go availability of mobile devices makes them central to many tasks such as interpersonal communication and media consumption.","However, despite the potential of mobile devices for on-demand exploratory data visualization, existing mobile interactions are difficult, often using highly custom interactions, complex gestures, or multi-modal input.","We synthesize limitations from the literature and outline four motivating principles for improved mobile interaction: leverage ubiquitous modalities, prioritize discoverability, enable rapid in-context data exploration, and promote graceful recovery.","We then contribute thirteen interaction candidates and conduct a formative study with twelve participants who experienced our interactions in a testbed prototype.","Based on these interviews, we discuss design considerations and tradeoffs from four main themes: precise and rapid inspection, focused navigation, single-touch and fixed orientation interaction, and judicious use of motion."],"url":"http://arxiv.org/abs/2404.11602v1"}
