{"created":"2024-04-28 20:44:53","title":"Towards Real-time Learning in Large Language Models: A Critical Review","abstract":"Real-time learning concerns the ability of learning systems to acquire knowledge over time, enabling their adaptation and generalization to novel tasks. It is a critical ability for intelligent, real-world systems, especially when data may be insufficient or difficult to obtain. This review provides a comprehensive analysis of real-time learning in Large Language Models. It synthesizes the state-of-the-art real-time learning paradigms, including continual learning, meta-learning, parameter-efficient learning, and mixture-of-experts learning. We demonstrate their utility for real-time learning by describing specific achievements from these related topics and their critical factors. Finally, the paper highlights current problems and challenges for future research in the field. By consolidating the latest relevant research developments, this review offers a comprehensive understanding of real-time learning and its implications for designing and developing LLM-based learning systems addressing real-world problems.","sentences":["Real-time learning concerns the ability of learning systems to acquire knowledge over time, enabling their adaptation and generalization to novel tasks.","It is a critical ability for intelligent, real-world systems, especially when data may be insufficient or difficult to obtain.","This review provides a comprehensive analysis of real-time learning in Large Language Models.","It synthesizes the state-of-the-art real-time learning paradigms, including continual learning, meta-learning, parameter-efficient learning, and mixture-of-experts learning.","We demonstrate their utility for real-time learning by describing specific achievements from these related topics and their critical factors.","Finally, the paper highlights current problems and challenges for future research in the field.","By consolidating the latest relevant research developments, this review offers a comprehensive understanding of real-time learning and its implications for designing and developing LLM-based learning systems addressing real-world problems."],"url":"http://arxiv.org/abs/2404.18311v2"}
