{"created":"2024-09-25 02:32:54","title":"A multi-scale probabilistic methodology to predict high-cycle fatigue lifetime for alloys with process-induced pores","abstract":"A multi-scale methodology is developed in conjunction with a probabilistic fatigue lifetime model for structures with pores whose exact distribution, i.e. geometries and locations, is unknown. The method takes into account uncertainty in fatigue lifetimes in structures due to defects at two scales: micro-scale heterogeneity & meso-scale pores. An element-wise probabilistic strain-life model with its criterion modified for taking into account multiaxial loading is developed for taking into account the effect of micro-scale defects on the lifetime. Meso-scale pores in the structure are taken into account via statistical modelling of the expected pore populations via a finite element method, based on tomographic scans of a small region of porous material used to make the structure. A previously implemented Neuber-type plastic correction algorithm is used for fast full-field approximation of the strain-life criterion around the statistically generated pore fields. The probability of failure of a porous structure is obtained via a weakest link assumption at the level of its constituent finite elements. The fatigue model can be identified via a maximum likelihood estimate on experimental fatigue data of structures containing different types of pore populations. The proposed method is tested on an existing high-cycle fatigue data-set of an aluminium alloy with two levels of porosity. The model requires lesser data for identification than traditional models that consider porous media as a homogeneous material, as the same base material is considered for the two grades of porous material. Numerical studies on synthetically generated data show that the method is capable of taking into account the statistical size effect in fatigue, and demonstrate that fatigue properties of subsurface porous material are lower than that of core porous material, which makes homogenisation of the method non-trivial.","sentences":["A multi-scale methodology is developed in conjunction with a probabilistic fatigue lifetime model for structures with pores whose exact distribution, i.e. geometries and locations, is unknown.","The method takes into account uncertainty in fatigue lifetimes in structures due to defects at two scales: micro-scale heterogeneity & meso-scale pores.","An element-wise probabilistic strain-life model with its criterion modified for taking into account multiaxial loading is developed for taking into account the effect of micro-scale defects on the lifetime.","Meso-scale pores in the structure are taken into account via statistical modelling of the expected pore populations via a finite element method, based on tomographic scans of a small region of porous material used to make the structure.","A previously implemented Neuber-type plastic correction algorithm is used for fast full-field approximation of the strain-life criterion around the statistically generated pore fields.","The probability of failure of a porous structure is obtained via a weakest link assumption at the level of its constituent finite elements.","The fatigue model can be identified via a maximum likelihood estimate on experimental fatigue data of structures containing different types of pore populations.","The proposed method is tested on an existing high-cycle fatigue data-set of an aluminium alloy with two levels of porosity.","The model requires lesser data for identification than traditional models that consider porous media as a homogeneous material, as the same base material is considered for the two grades of porous material.","Numerical studies on synthetically generated data show that the method is capable of taking into account the statistical size effect in fatigue, and demonstrate that fatigue properties of subsurface porous material are lower than that of core porous material, which makes homogenisation of the method non-trivial."],"url":"http://arxiv.org/abs/2409.16565v2"}
