{"created":"2025-03-17 15:16:59","title":"TablePilot: Recommending Human-Preferred Tabular Data Analysis with Large Language Models","abstract":"Tabular data analysis is crucial in many scenarios, yet efficiently identifying the most relevant data analysis queries and results for a new table remains a significant challenge. The complexity of tabular data, diverse analytical operations, and the demand for high-quality analysis make the process tedious. To address these challenges, we aim to recommend query-code-result triplets tailored for new tables in tabular data analysis workflows. In this paper, we present TablePilot, a pioneering tabular data analysis framework leveraging large language models to autonomously generate comprehensive and superior analytical results without relying on user profiles or prior interactions. The framework incorporates key designs in analysis preparation and analysis optimization to enhance accuracy. Additionally, we propose Rec-Align, a novel method to further improve recommendation quality and better align with human preferences. Experiments on DART, a dataset specifically designed for comprehensive tabular data analysis recommendation, demonstrate the effectiveness of our framework. Based on GPT-4o, the tuned TablePilot achieves 77.0% top-5 recommendation recall. Human evaluations further highlight its effectiveness in optimizing tabular data analysis workflows.","sentences":["Tabular data analysis is crucial in many scenarios, yet efficiently identifying the most relevant data analysis queries and results for a new table remains a significant challenge.","The complexity of tabular data, diverse analytical operations, and the demand for high-quality analysis make the process tedious.","To address these challenges, we aim to recommend query-code-result triplets tailored for new tables in tabular data analysis workflows.","In this paper, we present TablePilot, a pioneering tabular data analysis framework leveraging large language models to autonomously generate comprehensive and superior analytical results without relying on user profiles or prior interactions.","The framework incorporates key designs in analysis preparation and analysis optimization to enhance accuracy.","Additionally, we propose Rec-Align, a novel method to further improve recommendation quality and better align with human preferences.","Experiments on DART, a dataset specifically designed for comprehensive tabular data analysis recommendation, demonstrate the effectiveness of our framework.","Based on GPT-4o, the tuned TablePilot achieves 77.0% top-5 recommendation recall.","Human evaluations further highlight its effectiveness in optimizing tabular data analysis workflows."],"url":"http://arxiv.org/abs/2503.13262v2"}
