{"created":"2025-03-12 10:56:02","title":"DeepInnovation AI: A Global Dataset Mapping the AI innovation from Academic Research to Industrial Patents","abstract":"In the rapidly evolving field of artificial intelligence (AI), mapping innovation patterns and understanding effective technology transfer from research to applications are essential for economic growth. However, existing data infrastructures suffer from fragmentation, incomplete coverage, and insufficient evaluative capacity. Here, we present DeepInnovationAI, a comprehensive global dataset containing three structured files. DeepPatentAI.csv: Contains 2,356,204 patent records with 8 field-specific attributes. DeepDiveAI.csv: Encompasses 3,511,929 academic publications with 13 metadata fields. These two datasets leverage large language models, multilingual text analysis and dual-layer BERT classifiers to accurately identify AI-related content, while utilizing hypergraph analysis to create robust innovation metrics. Additionally, DeepCosineAI.csv: By applying semantic vector proximity analysis, this file presents approximately one hundred million calculated paper-patent similarity pairs to enhance understanding of how theoretical advancements translate into commercial technologies. DeepInnovationAI enables researchers, policymakers, and industry leaders to anticipate trends and identify collaboration opportunities. With extensive temporal and geographical scope, it supports detailed analysis of technological development patterns and international competition dynamics, establishing a foundation for modeling AI innovation and technology transfer processes.","sentences":["In the rapidly evolving field of artificial intelligence (AI), mapping innovation patterns and understanding effective technology transfer from research to applications are essential for economic growth.","However, existing data infrastructures suffer from fragmentation, incomplete coverage, and insufficient evaluative capacity.","Here, we present DeepInnovationAI, a comprehensive global dataset containing three structured files.","DeepPatentAI.csv: Contains 2,356,204 patent records with 8 field-specific attributes.","DeepDiveAI.csv:","Encompasses 3,511,929 academic publications with 13 metadata fields.","These two datasets leverage large language models, multilingual text analysis and dual-layer BERT classifiers to accurately identify AI-related content, while utilizing hypergraph analysis to create robust innovation metrics.","Additionally, DeepCosineAI.csv:","By applying semantic vector proximity analysis, this file presents approximately one hundred million calculated paper-patent similarity pairs to enhance understanding of how theoretical advancements translate into commercial technologies.","DeepInnovationAI enables researchers, policymakers, and industry leaders to anticipate trends and identify collaboration opportunities.","With extensive temporal and geographical scope, it supports detailed analysis of technological development patterns and international competition dynamics, establishing a foundation for modeling AI innovation and technology transfer processes."],"url":"http://arxiv.org/abs/2503.09257v2"}
