{"created":"2025-04-07 07:44:27","title":"TabRep: a Simple and Effective Continuous Representation for Training Tabular Diffusion Models","abstract":"Diffusion models have been the predominant generative model for tabular data generation. However, they face the conundrum of modeling under a separate versus a unified data representation. The former encounters the challenge of jointly modeling all multi-modal distributions of tabular data in one model. While the latter alleviates this by learning a single representation for all features, it currently leverages sparse suboptimal encoding heuristics and necessitates additional computation costs. In this work, we address the latter by presenting TabRep, a tabular diffusion architecture trained with a unified continuous representation. To motivate the design of our representation, we provide geometric insights into how the data manifold affects diffusion models. The key attributes of our representation are composed of its density, flexibility to provide ample separability for nominal features, and ability to preserve intrinsic relationships. Ultimately, TabRep provides a simple yet effective approach for training tabular diffusion models under a continuous data manifold. Our results showcase that TabRep achieves superior performance across a broad suite of evaluations. It is the first to synthesize tabular data that exceeds the downstream quality of the original datasets while preserving privacy and remaining computationally efficient.","sentences":["Diffusion models have been the predominant generative model for tabular data generation.","However, they face the conundrum of modeling under a separate versus a unified data representation.","The former encounters the challenge of jointly modeling all multi-modal distributions of tabular data in one model.","While the latter alleviates this by learning a single representation for all features, it currently leverages sparse suboptimal encoding heuristics and necessitates additional computation costs.","In this work, we address the latter by presenting TabRep, a tabular diffusion architecture trained with a unified continuous representation.","To motivate the design of our representation, we provide geometric insights into how the data manifold affects diffusion models.","The key attributes of our representation are composed of its density, flexibility to provide ample separability for nominal features, and ability to preserve intrinsic relationships.","Ultimately, TabRep provides a simple yet effective approach for training tabular diffusion models under a continuous data manifold.","Our results showcase that TabRep achieves superior performance across a broad suite of evaluations.","It is the first to synthesize tabular data that exceeds the downstream quality of the original datasets while preserving privacy and remaining computationally efficient."],"url":"http://arxiv.org/abs/2504.04798v2"}
